Repository: Sam9913/tapfood_merchant-v2
Catalog: lib/l10n/app_*.arb
Languages: ms, zh

# newer_version_found
source: Found newer version
ms: Menemui versi yang lebih baharu
zh: 发现更新版本

# newer_version_found_content
source: Please download latest version to proceed
ms: Sila muat turun versi terkini untuk meneruskan
zh: 请下载最新版本以继续

source: Download
ms: Muat turun
zh: 下载

source: Welcome
ms: Selamat datang
zh: 欢迎

source: Log In
ms: Log Masuk
zh: 登录

# log_in_content
source: Log In to your account
ms: Log masuk ke akaun anda
zh: 登录到您的帐户

source: Email
ms: E-mel
zh: 电子邮件

source: Password
ms: Kata laluan
zh: 密码

source: Welcome back
ms: Selamat kembali
zh: 欢迎回来

# login_fail
source: Wrong password or email
ms: Salah kata laluan atau emel
zh: 邮箱地址或密码错误

source: Account
ms: Akaun
zh: 帐户

source: Closed
ms: Tutup
zh: 休业

source: Open
ms: Buka
zh: 营业

source: Setting
ms: Tetapan
zh: 设置

source: App Version
ms: Versi Aplikasi
zh: 应用版本

source: Log Out
ms: Log Keluar
zh: 登出

source: Delivery
ms: Penghantaran
zh: 送货

source: Vehicle
ms: Kenderaan
zh: 车辆

# delivery_vehicle_message
source: Delivery vehicle updated to
ms: Kenderaan penghantaran dikemas kini kepada
zh: 送货车辆更新为

# preparation_time
source: Preparation Time (minute)
ms: Masa Persediaan (minit)
zh: 准备时间（分钟）

# preparation_time_message
source: Delivery preparation time updated to
ms: Masa penyediaan penghantaran dikemas kini kepada
zh: 交货准备时间更新为

source: minutes
ms: minits
zh: 分钟

# operation_hour
source: Regular Operation Hours
ms: Waktu Operasi Biasa
zh: 正常营业时间

# special_operation_hour
source: Special Hours
ms: Waktu Khas
zh: 特别营业时间

# special_hour_message
source: Special hour on
ms: Jam khas dihidupkan
zh: 特别营业时间

# edit_operation_hour
source: Edit Operation Hours
ms: Ubah Waktu Operasi
zh: 编辑营业时间

source: Add another time
ms: Tambah masa
zh: 添加时间

# confirm_operation_hour
source: Confirm Regular Hour
ms: Sahkan Waktu Biasa
zh: 确认正常营业时间

source: Add Special Hour
ms: Tambah Waktu Khas
zh: 添加特别营业时间

source: Edit Special Hour
ms: Ubah Waktu Khas
zh: 编辑特别营业时间

source: Special hour date
ms: Tarikh khas
zh: 特别营业日期

source: All day
ms: Sepanjang hari
zh: 整天

source: Confirm Special Hour
ms: Sahkan Waktu Khas
zh: 确认特别营业时间

source: Open At
ms: Buka Pada
zh: 营业时间

source: Close At
ms: Tutup Pada
zh: 休业时间

source: App Settings
ms: Tetapan Aplikasi
zh: 程序设置

source: Language
ms: Bahasa
zh: 语言

source: Store Settings
ms: Tetapan Kedai
zh: 商店设置

source: minute
ms: minit
zh: 分钟

# special_hour_removed
source: Special hour on [###Date###] removed.
ms: Jam khas semasa [###Date###] telah dipindah
zh: 特别营业时间[###Date###]已被移除

source: Auto Print Receipt
ms: Auto Cetak Resit
zh: 自动打印收据

source: Printer Setting
ms: Tetapan Pencetak
zh: 打印机设置

source: Home
ms: Muka Depan
zh: 首页

source: Orders
ms: Pesanan
zh: 订单

source: Preparing
ms: Bersedia
zh: 准备中

source: Upcoming
ms: Mendatang
zh: 正在迎来

source: Completed
ms: Telah siap
zh: 已完成

source: Order Details
ms: Maklumat Pesanan
zh: 订单详细信息

source: Rider
ms: Penunggang
zh: 骑士

source: Order Summary
ms: Ringkasan Pesanan
zh: 订单摘要

# customer_notes_title
source: Notes from customers
ms: Nota daripada pelanggan
zh: 客户备注

source: Cancel
ms: Batal
zh: 取消

source: Cancel confirmation
ms: Pengesahan batal
zh: 取消确认

# confirm_to_cancel
source: Confirm to cancel TF-[###OrderID###] by [###Name###]
ms: Sahkan untuk membatalkan TF-[###OrderID###] oleh [###Name###]
zh: 通过[###Name###]确认取消TF-[###OrderID###]

source: Cancelled
ms: Dibatalkan
zh: 已取消

source: Paid
ms: Sudah bayar
zh: 已付费

source: Unpaid
ms: Belum bayar
zh: 未付费

# delivery_order_description
source: [###ItemCount###] items for [###UserName###]
ms: [###ItemCount###] item untuk [###UserName###]
zh: [###ItemCount###] 个食品给予 [###UserName###]

# others_order_description
source: [###UserName###] ordered [###ItemCount###] items
ms: [###UserName###] memesan [###ItemCount###] item
zh: [###UserName###] 订购了 [###ItemCount###] 个食品

source: Done
ms: Siap
zh: 完成

# item_count
source: [###ItemCount###] items
ms: [###ItemCount###] item
zh: [###ItemCount###] 个食品

# for_user
source: for [###UserName###]
ms: untuk [###UserName###]
zh: 给予 [###UserName###]

# user_ordered
source: [###UserName###] ordered
ms: [###UserName###] memesan
zh: [###UserName###] 订购了

source: Subtotal
ms: Jumlah Sebahagian
zh: 部分总额

# order_total
source: Grand Total
ms: Jumlah Pesanan
zh: 总订单额

source: Table No
ms: Nombor Meja

source: Customer Name
ms: Nama

source: Order Preference
ms: Pilihan Pesanan

source: Dine In
ms: Makan dalam
zh: 内用

source: Self Pick Up
ms: Sendiri Pikap
zh: 自取

source: Drive Thru
ms: Pandu Lalu
zh: 得来速

source: Campus Delivery
ms: Penghantaran Kampus
zh: 校园外送

source: Order Time
ms: Masa Pesan
zh: 下单时间

source: Pick Up At
ms: Ambil Semasa
zh: 取单時間

source: Order Note
ms: Nota Pesanan
zh: 订单备注

source: Track #
ms: Jejak #
zh: 追踪#

# order_complete
source: Order Received
ms: Pesanan Selesai
zh: 订单已领取

source: New Order
ms: Pesanan Baru
zh: 新订单

# new_schedule_order
source: New Scheduled Order
ms: Pesanan Baru Berjadual
zh: 新预定订单

# order_time_arrive
source: Schedule Order Time Arrive
ms: Waktu Tiba untuk Pesanan Berjadual
zh: 预定订单时间抵达

source: Delivery Fee
ms: Bayaran Penghantaran
zh: 送货费用

source: Discount
ms: Diskaun
zh: 折扣

source: Tax
ms: Taks
zh: 税务

source: Platform Tax
ms: Cukai Platform
zh: 平台税务

source: Service Charge
ms: Caj Perkhidmatan
zh: 服务费

source: Government Tax
ms: Cukai Kerajaan
zh: 政府税

source: Queue No
ms: No Beratur
zh: 排队号

source: Addon
ms: Tambahan
zh: 添加物类别

source: Addon Item
ms: Item Tambahan
zh: 添加物项品

source: Required
ms: Dikehendaki
zh: 必选

source: Optional
ms: Pilihan
zh: 可选

source: Type
ms: Jenis
zh: 种类

source: Edit Linked Menu
ms: Ubah Menu Terpaut
zh: 编辑链接菜单

source: Remove Link
ms: Alih Keluar Pautan
zh: 移除链接

source: Link
ms: Pautan
zh: 链接

source: Search Addon
ms: Cari Tambahan
zh: 搜索添加物

# image_description
source: Accepted any images
ms: Menerima sebarang imej
zh: 接受任何图像

source: Take Away Price
ms: Harga Sendiri Pikap
zh: 自取价格

source: Delivery Price
ms: Harga Penghantaran
zh: 外送价格

source: Search Menu
ms: Cari Menu
zh: 搜索菜单

source: Menu Category
ms: Kategori Menu
zh: 菜单种类

source: Report
ms: Laporan
zh: 报告

source: Order of
ms: Pesanan dari
zh: 订单于

source: Start Date
ms: Tarikh Mula
zh: 开始日期

source: End Date
ms: Tarikh Tamat
zh: 结束日期

source: Summary
ms: Ringkasan
zh: 总结

source: Total Sales
ms: Jumlah Jualan
zh: 总销售额

source: Total Refund
ms: Jumlah Bayaran Balik
zh: 总退款额

source: Total Settlement
ms: Jumlah Penyelesaian
zh: 全额结算

source: Edit
ms: Ubah
zh: 编辑

source: removed
ms: dibuangkan
zh: 移除

source: Availability
ms: Ketersediaan
zh: 状态

source: Add a
ms: Tambahkan
zh: 添加一个

source: Name
ms: Nama
zh: 姓名

# price
source: Dine In Price
ms: Harga Makan Dalam Restaurant
zh: 餐厅内价格

source: Category
ms: Kategori
zh: 类别

source: Delete
ms: Padam
zh: 删除

source: Save
ms: Simpan Perubahan
zh: 保存

source: Add Category
ms: Tambah Kategori
zh: 添加类别

source: Add Item
ms: Tambah Item
zh: 添加项目

source: Description
ms: Penerangan
zh: 描述

source: Insert
ms: Masukkan
zh: 添加

source: Change
ms: Ubah
zh: 改变

source: Photo
ms: Foto
zh: 照片

source: Yes
ms: Ya
zh: 是

source: No
ms: Tidak
zh: 不是

source: Unavailable
ms: Tidak tersedia
zh: 不可用

source: Available
ms: Tersedia
zh: 可用

source: Search
ms: Cari
zh: 搜索

source: Food
ms: Makanan
zh: 食物

source: Beverage
ms: Minumam
zh: 饮料

# no_orders_within_date_range
source: No orders in the date range selected
ms: Tiada pesanan dalam julat tarikh yang dipilih
zh: 所选日期范围内没有订单

source: No addon
ms: Tiada tambahan
zh: 没有添加物

source: No menu
ms: Tiada menu
zh: 没有菜单

# no_addon_found
source: No addon related found
ms: Tiada tambahan berkaitan ditemui
zh: 没有找到相关添加物

# no_menu_found
source: No menu related found
ms: Tiada menu berkaitan ditemui
zh: 没有找到相关菜单

# internet_not_found
source: Internet connection not found
ms: Sambungan Internet tidak ditemui
zh: 未找到网络连接

# no_order_currently
source: No order in the current time
ms: Tiada pesanan dalam masa semasa
zh: 当前时间无订单

# tf_hours
source: 24 Hours
ms: 24 Jam
zh: 24小时

# error_name
source: Name is required field
ms: Medan nama diperlukan
zh: 名称字段为必填项

# error_menuCategory
source: Menu Category is required field
ms: Medan Kategori Menu diperlukan
zh: 菜单类别字段为必填项

# error_price
source: Price is required field
ms: Medan harga diperlukan
zh: 价格字段为必填项

# error_description
source: Description is required field
ms: Medan penerangan diperlukan
zh: 描述字段是必需的

# cover_most
source: Unable to add because previous operation time already cover 22 hours
ms: Tidak dapat menambah kerana masa operasi sebelum ini sudah meliputi 22 jam
zh: 无法添加，因为之前的操作时间已超过22个小时

# illogic_operation_add
source: Unable to add because crash on previous operation time
ms: Tidak dapat menambah kerana ranap pada masa operasi sebelumnya
zh: 无法添加，因为在之前的操作时间崩溃

# illogic_operation_edit
source: Unable to edit because crash on previous operation time
ms: Tidak dapat tukar kerana ranap pada masa operasi sebelumnya
zh: 无法更改，因为在之前的操作时间崩溃

# special_hour_delete_success
source: Special operation hour on [###Date###] deleted
ms: Waktu operasi khas pada [###Date###] telah dipadam
zh: 特殊营业时间于[###Date###]已删除

# special_hour_insert_success
source: Special operation hour on [###Date###] added
ms: Waktu operasi khas pada [###Date###] telah ditambah
zh: 特殊营业时间于[###Date###]已添加

# special_hour_update_success
source: Special operation hour on [###Date###] updated
ms: Waktu operasi khas pada [###Date###] telah dikemas kini
zh: 特殊营业时间于[###Date###]已更新

# operation_hour_delete_success
source: Operation hour deleted
ms: Waktu operasi telah dipadam
zh: 营业时间已删除

# operation_hour_insert_success
source: Operation hour added
ms: Waktu operasi telah ditambah
zh: 营业时间已添加

# operation_hour_update_success
source: Operation hour updated
ms: Waktu operasi telah dikemas kini
zh: 营业时间已更新

# addon_delete_success
source: Addon([###Name###]) is deleted
ms: Tambahan([###Name###]) telah dipadam
zh: 添加物([###Name###])已删除

# addon_insert_success
source: Addon([###Name###]) is added
ms: Tambahan([###Name###]) telah ditambah
zh: 添加物([###Name###])已添加

# addon_update_success
source: Addon([###Name###]) is updated
ms: Tambahan([###Name###]) telah dikemas kini
zh: 添加物([###Name###])已更新

# addon_status_update_success
source: Addon([###Name###]) status updated
ms: Tambahan([###Name###]) status telah dikemas kini
zh: 添加物[###Name###])已更新状态

# addon_category_delete_success
source: Addon category([###Name###]) is deleted
ms: Kategori tambahan([###Name###]) telah dipadam
zh: 添加物类别([###Name###])已删除

# addon_category_insert_success
source: Addon category([###Name###]) is added
ms: Kategori tambahan([###Name###]) telah ditambah
zh: 添加物类别([###Name###])已添加

# addon_category_update_success
source: Addon category([###Name###]) is updated
ms: Kategori tambahan([###Name###]) telah dikemas kini
zh: 添加物类别([###Name###])已更新

# addon_category_status_update_success
source: Addon category([###Name###]) status updated
ms: Kategori tambahan([###Name###]) status telah dikemas kini
zh: 添加物类别([###Name###])已更新状态

# menu_delete_success
source: Menu([###Name###]) is deleted
ms: Menu([###Name###]) telah dipadam
zh: 菜单([###Name###])已删除

# menu_insert_success
source: Menu([###Name###]) is added
ms: Menu([###Name###]) telah ditambah
zh: 菜单([###Name###])已添加

# menu_update_success
source: Menu([###Name###]) is updated
ms: Menu([###Name###]) telah dikemas kini
zh: 菜单([###Name###])已更新

# menu_status_update_success
source: Menu([###Name###]) status updated
ms: Menu([###Name###]) status telah dikemas kini
zh: 菜单([###Name###])已更新状态

# menu_category_delete_success
source: Menu category([###Name###]) is deleted
ms: Kategori menu([###Name###]) telah dipadam
zh: 菜单类别([###Name###])已删除

# menu_category_insert_success
source: Menu category([###Name###]) is added
ms: Kategori menu([###Name###]) telah ditambah
zh: 菜单类别([###Name###])已添加

# menu_category_update_success
source: Menu category([###Name###]) is updated
ms: Kategori menu([###Name###]) telah dikemas kini
zh: 菜单类别([###Name###])已更新

# menu_category_status_update_success
source: Menu category([###Name###]) status updated
ms: Kategori menu([###Name###]) status telah dikemas kini
zh: 菜单类别([###Name###])已更新状态

# order_payment_update
source: TF-[###OrderID###] update to paid
ms: TF-[###OrderID###] telah bayar
zh: TF-[###OrderID###]已付款

# order_cancel_success
source: TF-[###OrderID###] cancelled
ms: TF-[###OrderID###] telah dibatal
zh: TF-[###OrderID###]已取消

# order_status_update_success
source: TF-[###OrderID###] completed
ms: TF-[###OrderID###] telah siap
zh: TF-[###OrderID###]已完成

# delete_fail
source: Fail to delete, please try again later
ms: Gagal memadam, sila cuba lagi kemudian
zh: 删除失败，请稍后再试

# update_fail
source: Fail to update, please try again later
ms: Gagal mengemas kini, sila cuba lagi kemudian
zh: 更新失败，请稍后再试

# insert_fail
source: Fail to insert, please try again later
ms: Gagal memasukkan, sila cuba lagi kemudian
zh: 添加失败，请稍后重试

# cancel_fail
source: Fail to cancel, please try again later
ms: Gagal batal, sila cuba lagi kemudian
zh: 取消失败，请稍后重试

source: Monday
ms: Isnin
zh: 星期一

source: Tuesday
ms: Selasa
zh: 星期二

source: Wednesday
ms: Rabu
zh: 星期三

source: Thursday
ms: Khamis
zh: 星期四

source: Friday
ms: Jumaat
zh: 星期五

source: Saturday
ms: Sabtu
zh: 星期六

source: Sunday
ms: Ahad
zh: 星期日

source: No special hour
ms: Tiada waktu operasi khas
zh: 没有特殊营业时间

source: Add
ms: Tambah
zh: 添加

source: Menu
zh: 菜单类别

source: Menu Item
zh: 菜单项品

source: items
zh: 项品
